src/cf/Логистика/src/ExchangePlans/СинхронизацияКафка/СинхронизацияКафка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="c9826621-5963-49d8-b6ad-ec3274d26c41">
  <name>СинхронизацияКафка</name>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначениеУзлаОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Топик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦентральныйОфис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

src/cf/Логистика/src/Enums/НазначениеУзлаОбмена/НазначениеУзлаОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначениеУзлаОбмена</name>
  <enumValues>
    <name>Справочники</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
</mdclass:Enum>

src/cf/Логистика/src/ExchangePlans/СинхронизацияКафка/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Если Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначениеУзлаОбмена.Справочники") И НЕ Объект.ЦентральныйОфис Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка справочников из подчиненной базы не предусмротрена");
		Возврат;
	КонецЕсли;
	
	ВыгрузитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	ЗагрузитьДанныеНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	СтруктураРезультатВыполнения = ЛогистикаСинхронизацияСервер.ИнициализацияПросмотр(Объект.АдресСервера);    
	Если СтруктураРезультатВыполнения.Успех Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подключение успешно установлено");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + СтруктураРезультатВыполнения.ОписаниеОшибки);	
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеНаСервере()
	Если Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Справочники Тогда
		СтруктураРезультат = ЛогистикаСинхронизацияСервер.ВыгрузитьСправочникиНаСервер();
		Если СтруктураРезультат.Успех Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка справочников успешно завершена");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + СтруктураРезультат.ОписаниеОшибки);	
		КонецЕсли;
	ИначеЕсли Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Документы Тогда
		СтруктураРезультат = ЛогистикаСинхронизацияСервер.ВыгрузитьДокументыНаСервер();
		Если СтруктураРезультат.Успех Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка документов успешно завершена");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + СтруктураРезультат.ОписаниеОшибки);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере()
	Если Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Справочники Тогда
		ЛогистикаСинхронизацияСервер.ЗагрузитьСправочникиССервера();
	ИначеЕсли Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Документы Тогда 
		ЛогистикаСинхронизацияСервер.ЗагрузитьДокументыССервера();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
